def area(a, b):
    '''
    Возвращает площадь прямоугольника.

        Параметры:
                a (float) : одна сторона прямоугольника
                b (float) : вторая сторона прямоугольника

        Возвращаемое значение:
                float : площадь прямоугольника со сторонами a и b
    ''' 
    return a * b 

def perimeter(a, b): 
    '''
    Возвращает периметр прямоугольника.

        Параметры:
                a (float) : одна сторона прямоугольника
                b (float) : вторая сторона прямоугольника

        Возвращаемое значение:
                float : периметр прямоугольника со сторонами a и b

    ''' 
    return (a + b) * 2 
